app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {
        $pageTitle = 'Dashboard';
        $branchCount = Branch::count();
        $branchs = Branch::latest()->take(5)->get();
        $courierInfoCount = CourierInfo::count();
        $managerCount = User::where('user_type', 'manager')->count();
        $totalIncome = CourierPayment::sum('amount');
        $userLoginData = UserLogin::where('created_at', '>=', \Carbon\Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select count(*) as aggregate from `branches`
select * from `branches` order by `created_at` desc limit 5
select count(*) as aggregate from `courier_infos`
select count(*) as aggregate from `users` where `user_type` = 'manager'
select sum(`amount`) as aggregate from `courier_payments`
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2022-07-02 22:38:39'